In [12]:
pip install sklearn

Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 19.2.3, however version 20.2.2 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

Collecting sklearn
  Downloading https://files.pythonhosted.org/packages/1e/7a/dbb3be0ce9bd5c8b7e3d87328e79063f8b263b2b1bfa4774cb1147bfcd3f/sklearn-0.0.tar.gz
Collecting scikit-learn (from sklearn)
  Downloading https://files.pythonhosted.org/packages/f4/f1/eb2c04ec65461cbf292293908d8cddc05dadce164f94b45345cc4807f812/scikit_learn-0.23.2-cp38-cp38-win32.whl (6.0MB)
Collecting threadpoolctl>=2.0.0 (from scikit-learn->sklearn)
  Downloading https://files.pythonhosted.org/packages/f7/12/ec3f2e203afa394a149911729357aa48affc59c20e2c1c8297a60f33f133/threadpoolctl-2.1.0-py3-none-any.whl
Requirement already satisfied: scipy>=0.19.1 in c:\users\rishi\appdata\local\programs\python\python38-32\lib\site-packages (from scikit-learn->sklearn) (1.5.2)
Collecting joblib>=0.11 (from scikit-learn->sklearn)
  Downloading https://files.pythonhosted.org/packages/51/dd/0e015051b4a27ec5a58b02ab774059f3289a94b0906f880a3f9507e74f38/joblib-0.16.0-py3-none-any.whl (300kB)
Requirement already satisfied: numpy>=1.13.3 in c:\users\rishi\appdata\local\programs\python\python38-32\lib\site-packages (from scikit-learn->sklearn) (1.19.1)
Installing collected packages: threadpoolctl, joblib, scikit-learn, sklearn
  Running setup.py install for sklearn: started
    Running setup.py install for sklearn: finished with status 'done'
Successfully installed joblib-0.16.0 scikit-learn-0.23.2 sklearn-0.0 threadpoolctl-2.1.0

In [13]:
pip install -U scikit-learn

Requirement already up-to-date: scikit-learn in c:\users\rishi\appdata\local\programs\python\python38-32\lib\site-packages (0.23.2)
Requirement already satisfied, skipping upgrade: scipy>=0.19.1 in c:\users\rishi\appdata\local\programs\python\python38-32\lib\site-packages (from scikit-learn) (1.5.2)
Requirement already satisfied, skipping upgrade: joblib>=0.11 in c:\users\rishi\appdata\local\programs\python\python38-32\lib\site-packages (from scikit-learn) (0.16.0)
Requirement already satisfied, skipping upgrade: numpy>=1.13.3 in c:\users\rishi\appdata\local\programs\python\python38-32\lib\site-packages (from scikit-learn) (1.19.1)
Requirement already satisfied, skipping upgrade: threadpoolctl>=2.0.0 in c:\users\rishi\appdata\local\programs\python\python38-32\lib\site-packages (from scikit-learn) (2.1.0)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 19.2.3, however version 20.2.2 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

In [15]:
 pip install --upgrade pip

Collecting pip
  Downloading https://files.pythonhosted.org/packages/5a/4a/39400ff9b36e719bdf8f31c99fe1fa7842a42fa77432e584f707a5080063/pip-20.2.2-py2.py3-none-any.whl (1.5MB)
Installing collected packages: pip
  Found existing installation: pip 19.2.3
    Uninstalling pip-19.2.3:
      Successfully uninstalled pip-19.2.3
Successfully installed pip-20.2.2Note: you may need to restart the kernel to use updated packages.

In [16]:
pip install seaborn

Requirement already satisfied: seaborn in c:\users\rishi\appdata\local\programs\python\python38-32\lib\site-packages (0.10.1)
Requirement already satisfied: matplotlib>=2.1.2 in c:\users\rishi\appdata\local\programs\python\python38-32\lib\site-packages (from seaborn) (3.3.1)
Requirement already satisfied: scipy>=1.0.1 in c:\users\rishi\appdata\local\programs\python\python38-32\lib\site-packages (from seaborn) (1.5.2)
Requirement already satisfied: numpy>=1.13.3 in c:\users\rishi\appdata\local\programs\python\python38-32\lib\site-packages (from seaborn) (1.19.1)
Requirement already satisfied: pandas>=0.22.0 in c:\users\rishi\appdata\local\programs\python\python38-32\lib\site-packages (from seaborn) (1.1.1)
Requirement already satisfied: certifi>=2020.06.20 in c:\users\rishi\appdata\local\programs\python\python38-32\lib\site-packages (from matplotlib>=2.1.2->seaborn) (2020.6.20)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.3 in c:\users\rishi\appdata\local\programs\python\python38-32\lib\site-packages (from matplotlib>=2.1.2->seaborn) (2.4.7)
Requirement already satisfied: python-dateutil>=2.1 in c:\users\rishi\appdata\local\programs\python\python38-32\lib\site-packages (from matplotlib>=2.1.2->seaborn) (2.8.1)
Requirement already satisfied: cycler>=0.10 in c:\users\rishi\appdata\local\programs\python\python38-32\lib\site-packages (from matplotlib>=2.1.2->seaborn) (0.10.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\rishi\appdata\local\programs\python\python38-32\lib\site-packages (from matplotlib>=2.1.2->seaborn) (1.2.0)
Requirement already satisfied: pillow>=6.2.0 in c:\users\rishi\appdata\local\programs\python\python38-32\lib\site-packages (from matplotlib>=2.1.2->seaborn) (7.2.0)
Requirement already satisfied: pytz>=2017.2 in c:\users\rishi\appdata\local\programs\python\python38-32\lib\site-packages (from pandas>=0.22.0->seaborn) (2020.1)
Requirement already satisfied: six>=1.5 in c:\users\rishi\appdata\local\programs\python\python38-32\lib\site-packages (from python-dateutil>=2.1->matplotlib>=2.1.2->seaborn) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [17]:
## data analysis and wrangling libraries
import pandas as pd
import numpy as np
import random as rnd

## visualisation
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

## machine learning libraries
from sklearn.linear_model import LogisticRegression

In [18]:
train_df=pd.read_csv("train.csv")
test_df=pd.read_csv("test.csv")
combine = [train_df,test_df]

In [19]:
print(train_df.columns.values)

['PassengerId' 'Survived' 'Pclass' 'Name' 'Sex' 'Age' 'SibSp' 'Parch'
 'Ticket' 'Fare' 'Cabin' 'Embarked']

In [20]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
train_df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [24]:
train_df.info()
print("--"*20)
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 66.2+ KB
----------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 27.8+ KB

In [25]:
train_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [38]:
train_df.describe(include=[ "O" ])

                                          Name   Sex    Ticket Cabin Embarked
count                                      891   891       891   204      889
unique                                     891     2       681   147        3
top     Chibnall, Mrs. (Edith Martha Bowerman)  male  CA. 2343    G6        S
freq                                         1   577         7     4      644

In [43]:
train_df[['Pclass','Survived']].groupby(['Pclass'],as_index=False).mean().sort_values(by="Survived",ascending=False)

   Pclass  Survived
0       1  0.629630
1       2  0.472826
2       3  0.242363

In [44]:
train_df[['Sex','Survived']].groupby(['Sex'],as_index=False).mean().sort_values(by="Survived",ascending=False)

      Sex  Survived
0  female  0.742038
1    male  0.188908

In [45]:
train_df[['SibSp','Survived']].groupby(['SibSp'],as_index=False).mean().sort_values(by="Survived",ascending=False)

   SibSp  Survived
1      1  0.535885
2      2  0.464286
0      0  0.345395
3      3  0.250000
4      4  0.166667
5      5  0.000000
6      8  0.000000

In [47]:
train_df[['Parch','Survived']].groupby(['Parch'],as_index=False).mean().sort_values(by="Survived",ascending=False)

   Parch  Survived
3      3  0.600000
1      1  0.550847
2      2  0.500000
0      0  0.343658
5      5  0.200000
4      4  0.000000
6      6  0.000000